## Terraform Plan Results

✅ Plan succeeded

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.firestore.google_firebaserules_release.firestore will be destroyed
  # (because google_firebaserules_release.firestore is not in configuration)
  - resource "google_firebaserules_release" "firestore" {
      - create_time  = "2026-01-29T02:53:52.666651Z" -> null
      - disabled     = false -> null
      - id           = "projects/wedding-smile-catcher/releases/cloud.firestore" -> null
      - name         = "cloud.firestore" -> null
      - project      = "wedding-smile-catcher" -> null
      - ruleset_name = "480339b4-5011-4284-b68c-172250aed8a1" -> null
      - update_time  = "2026-01-29T02:53:52.666651Z" -> null
    }

  # module.firestore.google_firebaserules_ruleset.firestore will be destroyed
  # (because google_firebaserules_ruleset.firestore is not in configuration)
  - resource "google_firebaserules_ruleset" "firestore" {
      - create_time = "2026-01-29T02:53:52.343551Z" -> null
      - id          = "projects/wedding-smile-catcher/rulesets/480339b4-5011-4284-b68c-172250aed8a1" -> null
      - metadata    = [
          - {
              - services = [
                  - "cloud.firestore",
                ]
            },
        ] -> null
      - name        = "480339b4-5011-4284-b68c-172250aed8a1" -> null
      - project     = "wedding-smile-catcher" -> null

      - source {
          - files {
              - content = <<-EOT
                    rules_version = '2';
                    service cloud.firestore {
                      match /databases/{database}/documents {
                        // Default: deny all access
                        match /{document=**} {
                          allow read, write: if false;
                        }
                    
                        // Accounts collection
                        // Owner-only read/create/update; no client-side delete
                        match /accounts/{accountId} {
                          allow read: if request.auth != null && request.auth.uid == accountId;
                          allow create: if request.auth != null && request.auth.uid == accountId;
                          allow update: if request.auth != null && request.auth.uid == accountId;
                          allow delete: if false;
                        }
                    
                        // Events collection
                        // Public get (single doc) for ranking UI status check
                        // List (query) restricted to authenticated users
                        // Only the event owner (account_id) can write
                        match /events/{eventId} {
                          allow get: if true;
                          allow list: if request.auth != null;
                          allow create: if request.auth != null
                            && request.resource.data.account_id == request.auth.uid;
                          allow update, delete: if request.auth != null
                            && resource.data.account_id == request.auth.uid;
                        }
                    
                        // Users collection
                        // Public read for ranking display
                        // Write restricted to Cloud Functions (server-side only)
                        match /users/{userId} {
                          allow read: if true;
                          allow create, update: if false;
                          allow delete: if request.auth != null;
                        }
                    
                        // Images collection
                        // Public read for ranking display
                        // Write restricted to Cloud Functions (server-side only)
                        match /images/{imageId} {
                          allow read: if true;
                          allow create, update: if false;
                          allow delete: if request.auth != null;
                        }
                      }
                    }
                EOT -> null
              - name    = "firestore.rules" -> null
            }
        }
    }

  # module.functions.data.archive_file.scoring_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "scoring_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/scoring"
      + type                = "zip"
    }

  # module.functions.data.archive_file.webhook_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "webhook_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/webhook"
      + type                = "zip"
    }

  # module.functions.google_cloudfunctions2_function.scoring will be updated in-place
  ~ resource "google_cloudfunctions2_function" "scoring" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/scoring"
        name             = "scoring"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/scoring-a550c49cc24649c3c9d6e7fb0544e3eb.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions.google_cloudfunctions2_function.webhook will be updated in-place
  ~ resource "google_cloudfunctions2_function" "webhook" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/webhook"
        name             = "webhook"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/webhook-29155a80fa32342c1270a45b171107db.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions.google_storage_bucket_object.scoring_source must be replaced
-/+ resource "google_storage_bucket_object" "scoring_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "V5RSJg==" -> (known after apply)
      ~ detect_md5hash   = "pVDEnMJGScPJ1uf7BUTj6w==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1769655233105043 -> (known after apply)
      ~ id               = "wedding-smile-images-wedding-smile-catcher-functions/scoring-a550c49cc24649c3c9d6e7fb0544e3eb.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "pVDEnMJGScPJ1uf7BUTj6w==" -> (known after apply)
      ~ md5hexhash       = "a550c49cc24649c3c9d6e7fb0544e3eb" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fscoring-a550c49cc24649c3c9d6e7fb0544e3eb.zip?generation=1769655233105043&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "functions/scoring-a550c49cc24649c3c9d6e7fb0544e3eb.zip" # forces replacement -> (known after apply) # forces replacement
      ~ output_name      = "functions/scoring-a550c49cc24649c3c9d6e7fb0544e3eb.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fscoring-a550c49cc24649c3c9d6e7fb0544e3eb.zip" -> (known after apply)
      ~ source           = "./.terraform/tmp/scoring-20260129025351.zip" # forces replacement -> (known after apply) # forces replacement
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

  # module.functions.google_storage_bucket_object.webhook_source must be replaced
-/+ resource "google_storage_bucket_object" "webhook_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "Sgxasg==" -> (known after apply)
      ~ detect_md5hash   = "KRVagPoyNCwScKRbFxEH2w==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1769655233752457 -> (known after apply)
      ~ id               = "wedding-smile-images-wedding-smile-catcher-functions/webhook-29155a80fa32342c1270a45b171107db.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "KRVagPoyNCwScKRbFxEH2w==" -> (known after apply)
      ~ md5hexhash       = "29155a80fa32342c1270a45b171107db" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fwebhook-29155a80fa32342c1270a45b171107db.zip?generation=1769655233752457&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "functions/webhook-29155a80fa32342c1270a45b171107db.zip" # forces replacement -> (known after apply) # forces replacement
      ~ output_name      = "functions/webhook-29155a80fa32342c1270a45b171107db.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/wedding-smile-images-wedding-smile-catcher/o/functions%2Fwebhook-29155a80fa32342c1270a45b171107db.zip" -> (known after apply)
      ~ source           = "./.terraform/tmp/webhook-20260129025351.zip" # forces replacement -> (known after apply) # forces replacement
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 4 to destroy.
```

</details>

**Pusher**: @nakayamaryo0731
**Action**: pull_request
